base-case/flatPlate-test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    flatPlate
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          615;
        startFace       132610;
    }
    symBoundTop
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          635;
        startFace       133225;
    }
    symBoundBottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          20;
        startFace       133860;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          133350;
        startFace       133880;
    }
    inlet
    {
        type            patch;
        nFaces          105;
        startFace       267230;
    }
    outlet
    {
        type            patch;
        nFaces          105;
        startFace       267335;
    }
)

// ************************************************************************* //
