base-case/flatPlate-test/system/sampleTauW
setFormat raw;
surfaceFormat raw;
interpolationScheme cellPoint;
writeControl    writeTime;

fields
(
	mag(wallShearStress)
);

 type  sets;
 sets
 (
   line
   {
      type lineFace;
      axis x;

      start ( 0 0 0.05);
      end ( 2.9 0 0.05);
   }

 );

